{
  "irVersion": "1.0",
  "project": "PipelineConductor",
  "repository": "https://github.com/plexusone/pipelineconductor",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-04-25",
      "highlights": [
        { "description": "Workflow compliance checking against reference repositories with exact and equivalent matching" },
        { "description": "Local filesystem collector for scanning repositories without GitHub API" },
        { "description": "GitHub Action for CI/CD integration with compliance checks" },
        { "description": "Automated workflow remediation with template-based generation" }
      ],
      "added": [
        { "description": "Compliance check result model types (`CheckResult`, `CheckSummary`, `RepoCheckResult`)", "commit": "bc9f5cf" },
        { "description": "Local filesystem collector with parallel scanning and language detection", "commit": "40c3f07" },
        { "description": "Workflow compliance checker with reference repository matching", "commit": "c6a50b9" },
        { "description": "HTML report formatter for compliance check results", "commit": "81981ef" },
        { "description": "Markdown report formatter for compliance check results", "commit": "81981ef" },
        { "description": "GitHub Action (`action.yaml`) for compliance checking in CI pipelines", "commit": "fcb8611" },
        { "description": "JSON Schema for check result validation (`schema/check_result.schema.json`)", "commit": "585796d" },
        { "description": "Cedar policy examples for workflow compliance (strict, gradual, base)", "commit": "1db9c44" },
        { "description": "Workflow generator with templates for Go CI, lint, and CodeQL", "commit": "3a3d3c9" },
        { "description": "Compliance context in policy evaluation (`ComplianceContext`)", "commit": "0b49253" },
        { "description": "Multi-source repository collection (`ListUserRepos`, `ListReposMultiSource`)", "commit": "0b49253" },
        { "description": "Dashforge dashboard generation for compliance results with metrics, charts, and tables", "commit": "4d59037" }
      ],
      "changed": [
        { "description": "**BREAKING**: Module path migrated from `github.com/grokify/pipelineconductor` to `github.com/plexusone/pipelineconductor`", "commit": "5757df5" }
      ],
      "documentation": [
        { "description": "CLI documentation for `check`, `apply`, and `remediate` commands", "commit": "c1eeec0" },
        { "description": "Dashboard and workflow example configurations", "commit": "f7390d7" },
        { "description": "Compliance scan planning documents", "commit": "4dc1585" },
        { "description": "MkDocs site URLs updated to plexusone organization", "commit": "19c37a1" },
        { "description": "PlexusOne unified MkDocs theme with dark mode default", "commit": "90864b3" },
        { "description": "README icons added to Features section", "commit": "f686343" },
        { "description": "README shields updated", "commit": "b8c045e" },
        { "description": "Release notes for v0.2.0", "commit": "56139e9" },
        { "description": "README updated with v0.2.0 features and check command examples", "commit": "ad086d1" },
        { "description": "Changelog page added to MkDocs documentation", "commit": "ad086d1" }
      ],
      "dependencies": [
        { "description": "`github.com/google/go-github/v84` upgraded from v82 for gogithub compatibility", "commit": "43fd83e" },
        { "description": "`github.com/cedar-policy/cedar-go` v1.6.0 (from v1.4.1)", "commit": "9d51d57" },
        { "description": "`github.com/grokify/gogithub` v0.12.1 (from v0.7.0)", "commit": "865170a" },
        { "description": "`github.com/grokify/mogo` v0.74.2 (from v0.72.7)", "commit": "d4a6307" },
        { "description": "`golang.org/x/oauth2` v0.36.0", "commit": "0d4b015" },
        { "description": "`github.com/plexusone/dashforge` v0.1.0 for dashboard generation", "commit": "4d59037" }
      ],
      "internal": [
        { "description": "CI workflows updated to shared workflows", "commit": "22dd50a" },
        { "description": "Workflow filenames standardized", "commit": "8db95fd" },
        { "description": "Batch workflow update script added", "commit": "21ad16e" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-31",
      "highlights": [
        { "description": "Multi-org GitHub repository scanning with Cedar policy-as-code evaluation" },
        { "description": "Four output formats (JSON, Markdown, SARIF, CSV) with GitHub Security integration" },
        { "description": "Built-in rate limiting with exponential backoff for large-scale scans" }
      ],
      "added": [
        { "description": "CLI with `scan`, `validate`, and `version` commands using Cobra framework", "commit": "20f17d1" },
        { "description": "GitHub collector for repository, workflow, and branch protection data", "commit": "20f17d1" },
        { "description": "Cedar policy engine with support for custom and built-in policies", "commit": "20f17d1" },
        { "description": "Built-in policies: `require-workflow`, `require-tests`, `go-versions`", "commit": "3c463ac" },
        { "description": "Profile system with three built-in profiles: `default`, `modern`, `legacy`", "commit": "3c463ac" },
        { "description": "JSON report format with compliance summary and per-repo details", "commit": "20f17d1" },
        { "description": "Markdown report format with status icons and severity indicators", "commit": "20f17d1" },
        { "description": "SARIF 2.1.0 report format for GitHub Security tab integration", "commit": "20f17d1" },
        { "description": "CSV report format for spreadsheet analysis", "commit": "20f17d1" },
        { "description": "Repository filtering by language, topics, visibility, archived/fork status", "commit": "20f17d1" },
        { "description": "Policy validation command with syntax checking", "commit": "20f17d1" },
        { "description": "Rate limiting with automatic retry, exponential backoff, and GitHub `X-RateLimit-*` header support", "commit": "20f17d1" },
        { "description": "Example Cedar policies for Go projects (merge, versions, matrix, dependencies, reusable-workflow)", "commit": "3c463ac" }
      ],
      "fixed": [
        { "description": "Windows CI failures due to PowerShell misinterpreting `./...` path", "commit": "92e008c" }
      ],
      "documentation": [
        { "description": "MkDocs documentation site with Material theme (21 pages)", "commit": "695fd73" },
        { "description": "CLI reference for scan, validate, and configuration", "commit": "695fd73" },
        { "description": "Cedar policy syntax guide and writing policies tutorial", "commit": "695fd73" },
        { "description": "Profile system documentation with customization guide", "commit": "695fd73" },
        { "description": "GitHub Actions integration guide with workflow examples", "commit": "695fd73" },
        { "description": "SARIF integration guide for GitHub Security tab", "commit": "695fd73" },
        { "description": "Contributing guide and development roadmap", "commit": "695fd73" },
        { "description": "Release notes for v0.1.0", "commit": "872a9d8" },
        { "description": "Releases section added to MkDocs navigation", "commit": "5988e73" },
        { "description": "Limitations column added to Enterprise Practice Summary in MRD", "commit": "e3185c9" },
        { "description": "README shields for CI, Go Report Card, and license", "commit": "300c38e" }
      ],
      "tests": [
        { "description": "Unit tests for policy engine (5 tests)", "commit": "20f17d1" },
        { "description": "Unit tests for profile manager (8 tests)", "commit": "20f17d1" },
        { "description": "Unit tests for report generation (8 tests)", "commit": "20f17d1" },
        { "description": "Unit tests for repository filtering (12 tests)", "commit": "20f17d1" },
        { "description": "Unit tests for workflow parsing (8 tests)", "commit": "20f17d1" },
        { "description": "Unit tests for result handling (9 tests)", "commit": "20f17d1" }
      ],
      "dependencies": [
        { "description": "`github.com/cedar-policy/cedar-go` v1.4.1 for policy evaluation", "commit": "202497d" },
        { "description": "`github.com/google/go-github/v82` for GitHub API", "commit": "202497d" },
        { "description": "`github.com/grokify/gogithub` v0.7.0 for GitHub API helpers", "commit": "202497d" },
        { "description": "`github.com/grokify/mogo` v0.72.7 for HTTP retry transport", "commit": "202497d" },
        { "description": "`github.com/spf13/cobra` v1.10.2 for CLI framework", "commit": "202497d" },
        { "description": "`github.com/spf13/viper` v1.21.0 for configuration management", "commit": "202497d" }
      ],
      "internal": [
        { "description": "Initial project setup with go.mod, LICENSE, and CI workflow", "commit": "202497d" },
        { "description": "Bump actions/checkout from 4 to 6", "commit": "e85adbb" },
        { "description": "Bump actions/setup-go from 5 to 6", "commit": "73a874f" },
        { "description": "Bump golangci/golangci-lint-action from 6 to 9", "commit": "123ac3b" },
        { "description": "Bump codecov/codecov-action from 4 to 5", "commit": "b1c6b6f" }
      ]
    }
  ]
}
